// SYNTAX TEST "source.bsl"
#Область ИмяОбласти
// <- Token.Comment.Preproc
// ^ Token.Comment.Preproc
//       ^ Token.Comment.Preproc

Перем А Экспорт;
// <- Token.Keyword.Declaration
//    ^ Token.Name.Variable
//      ^ Token.Keyword

Перем А, Б;
//     ^ Token.Operator
//       ^ Token.Name.Variable

Перем А Экспорт, Б;
//    ^ Token.Name.Variable
//       ^ Token.Keyword
//             ^ Token.Operator
//               ^ Token.Name.Variable

Перем А, Б Экспорт;
//    ^ Token.Name.Variable
//     ^ Token.Operator
//       ^ Token.Name.Variable
//         ^ Token.Keyword

Перем А Экспорт, Б Экспорт;
//    ^ Token.Name.Variable
//       ^ Token.Keyword
//             ^ Token.Operator
//               ^ Token.Name.Variable
//                 ^ Token.Keyword

#Если Сервер Тогда
// <- Token.Comment.Preproc
//    ^^^^^^ Token.Comment.Preproc

// Комментарий процедуры
// <- Token.Comment.Single
&НаСервере
// <- Token.Name.Decorator
// ^ Token.Name.Decorator
Процедура ИмяПроцедуры(
// <- Token.Keyword
//        ^ Token.Name.Function
//                    ^ Token.Punctuation
    Знач ПараметрСКонстантой,
//  ^ Token.Keyword
//       ^ Token.Name.Variable
//                          ^ Token.Operator
    ОбычныйПараметр,
//  ^ Token.Name.Variable
    ПараметрСНекорректнымЗначением = Нелегальщина,
//                                  ^ Token.Generic.Error
    ПараметрСНекорректнымЗначением =НелегальщинаБезПробела,
//                                  ^ Token.Generic.Error
//                                                        ^ Token.Operator
    ПараметрСДефолтнымЧисловымЗначением = 0) Экспорт
//                                      ^ Token.Operator
//                                        ^ Token.Literal.Number
//                                         ^ Token.Punctuation
//                                           ^ Token.Keyword
    Б = "текст с экраннированной "" кавычкой" + "и конкатенаций""";
//       ^ Token.Literal.String
//                               ^^ Token.Literal.String.Escape
//                                              ^ Token.Literal.String
//                                                             ^^ Token.Literal.String.Escape
//                                                                ^ Token.Operator

    В = "многострочная
//      ^ Token.Literal.String
    |строка
//  ^ Token.Literal.String
    //|это комментарий
//      ^ Token.Comment.Single
    |// а это нет
//      ^ Token.Literal.String
    |";
//   ^ Token.Literal.String
//    ^ Token.Punctuation

    Г = "";
//      ^^ Token.Literal.String

    ТекстЗапроса =
    "ВЫБРАТЬ
//  ^^ Token.Literal.String
//   ^ Token.Keyword
    |	Таблица.Поле КАК Поле,
    |	МАКСИМУМ(Таблица.Поле2) КАК Поле2
    |ИЗ
    |	Таблица КАК Таблица
    |ГДЕ
    |	Таблица.Поле = 0
    |	И Таблица.Поле <> ""Строка""
    |	И ВЫРАЗИТЬ(Таблица.Поле КАК СТРОКА) <> """"
    |	И Таблица.Поле <> ""Строка с экраннированной """" кавычкой""
    //|Закомментированная строка
//  ^ Token.Literal.String Token.Comment.Single
    |// Закомметированная строка внутри запроса с кавычками ""ТЕКСТ""
//  ^ Token.Literal.String
//  ^ not:Token.Comment.Single
//   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ Token.Comment.Single
    |СГРУППИРОВАТЬ ПО
    |	Поле
    //|//АВТОУПОРЯДОЧИВАНИЕ";
//  ^^^^^^^^^^^^^^^^^^^^^^^^^ Token.Comment.Single
    |//АВТОУПОРЯДОЧИВАНИЕ";
//  ^^^^^^^^^^^^^^^^^^^^^^ Token.Literal.String
//  ^ not:Token.Comment.Single
//   ^^^^^^^^^^^^^^^^^^^^ Token.Comment.Single
//                       ^ not:Token.Comment.Single
//                        ^ Token.Operator

    // Проверка на корректность обработки FirstLineMatch и #include: source.sdbl
    СтрокаСоСловомВыбрать = "Some selected text";
//                                ^^^^^^ not:Token.Keyword

    Число = 0.0 * 100;
//  ^ Token.Name.Variable
//          ^^^ Token.Literal.Number
//              ^ Token.Operator

    Дата = '00010101000000';
//         ^^^^^^^^^^^^^^^^ Token.Literal.Date
    КороткаяДата = '00010101';
//                 ^^^^^^^^^^ Token.Literal.Date
    ДатаСРазделителями = '0001-01-01T00:00:00';
//                       ^^^^^^^^^^^^^^^^^^^^^ Token.Literal.Date
    КороткаяДатаСРазделителями = '0001/01/01';
//                               ^^^^^^^^^^^^ Token.Literal.Date
    СтрокаСДатойВнутри = "Литерал типа Дата: '00010101'";
//                                          ^^^^^^^^^^^^ Token.Literal.String
//                                           ^^^^^^^^^^ not:Token.Literal.Date

    Если А = 0 И НЕ Число <= 0 Тогда
//  ^ Token.Keyword
//         ^ Token.Operator
//           ^ Token.Literal.Number
//             ^ Token.Keyword
//               ^^ Token.Keyword
//                        ^^ Token.Operator
//                             ^ Token.Keyword

        ОбычныйПараметр = Истина;
//                        ^ Token.Keyword.Constant
    Иначе
//  ^ Token.Keyword
        ОбычныйПараметр = Ложь
    КонецЕсли;
//  ^ Token.Keyword

    Пока ЗначениеЗаполнено(Б) Цикл
//  ^ Token.Keyword
//       ^ Token.Name.Builtin
//                        ^ Token.Punctuation
//                          ^ Token.Name.Variable
//                           ^ Token.Punctuation
//                             ^ Token.Keyword
        Прервать;
//      ^ Token.Keyword
    КонецЦикла;
//  ^ Token.Keyword

    НевстроеннаяПроцедура();
//  ^ Token.Name.Function

    НовыйОбъект = Новый ТаблицаЗначений;
//                ^^^^^ Token.Keyword
//                     ^ Token.Name.Class
    НовыйОбъектСкобка = Новый("ТаблицаЗначений");
//                      ^^^^^ Token.Name.Builtin
//                           ^ Token.Punctuation

    ПрефиксЗначениеЗаполненоПостфикс = "";
//  ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ Token.Name.Variable
//                                  ^ Token.Operator
//                                    ^ Token.Literal.String
//                                     ^ Token.Literal.String
//                                      ^ Token.Punctuation

    // Проверка на корректность обработки начала и конца слова
    Объект.Сообщить().Если().Цикл().Новый;
//         ^^^^^^^^                 ^^^^^ Token.Name.Function
//                    ^^^^ Token.Name.Function
//                           ^^^^ Token.Name.Function
//                                 ^^^^^ Token.Name.Variable

    // Проверка подсветки глобальных свойств с точкой
    Справочники.ИмяСправочника.СоздатьЭлемент();
//  ^ Token.Name.Class
    А = ХранилищеПользовательскихНастроекДинамическихСписков.Сохранить();
//      ^ Token.Name.Class

    А = 0;
//  ^ Token.Name.Variable
//    ^ Token.Operator

    Б = А = 0;
//  ^ Token.Name.Variable
//    ^ Token.Operator
//        ^ Token.Operator

    Если А = Б Тогда
//       ^ Token.Name.Variable
//         ^ Token.Operator
    ИначеЕсли ЗначениеЗаполнено(А) = ЗначениеЗаполнено(Б) Тогда
//            ^ Token.Name.Builtin
//                                 ^ Token.Operator
    КонецЕсли;

    // TODO:
//     ^^^^ Token.Comment.Single

    Если А И
//       ^ Token.Name.Variable
        Б = В Тогда
//      ^ Token.Name.Variable       
        Б = 0;
//      ^ Token.Name.Variable
    КонецЕсли;

КонецПроцедуры
// <- Token.Keyword

Процедура НевстроеннаяПроцедура()
    Возврат;
//  ^ Token.Keyword
КонецПроцедуры

&Перед("ПередЗаписью")
// <- Token.Name.Decorator
// ^^^ Token.Name.Decorator
//     ^ Token.Punctuation
//      ^^^^^^^^^^^^^ Token.Name.Function
//                   ^ Token.Punctuation
Процедура Расш1_ПередЗаписью()

КонецПроцедуры

#КонецЕсли
// <- Token.Comment.Preproc
// ^ Token.Comment.Preproc

#КонецОбласти
// <- Token.Comment.Preproc
// ^ Token.Comment.Preproc

~Метка:
Перейти ~Метка;

Рез = Ждать Об; // Об имеет тип Обещание

Асинх Функция КопироватьФайлыАсинх(ИсхКаталог, ЦелКаталог)

Асинх Функция КопироватьФайлыАсинх(Знач ИсхКаталог, Знач ЦелКаталог)

Асинх Процедура П()

    Попытка
        Ждать НеNull(Null); 
    Исключение
        // Исключение из НеNull() будет перехвачено здесь
        Сообщить("Передали Null"); 
    КонецПопытки

КонецПроцедуры

Файлы = Ждать НайтиФайлыАсинх(ИсхКаталог, "*", Ложь); //2

СтрШаблон("Товар: %1, %2 не найден!", Номенклатура, Характеристика);
СтрШаблон("Скидка составила %1%%", 10);
ПростоСтрока = "Без интерполяции %% параметра.";
СтрШаблон(НСтр("ru = 'Проверка %1 внутри НСтр'"));
СтрШаблон("Проверка без интерполяции % параметра.");
СтрШаблон("Проверка с некорректной интерполяцией %A параметра.");

Строка = 
    "Пример";
    |Проблемы";

Строка = 
    "Пример"
    |Проблемы";

Строка = 
    "Пример
    |Легально";

НСтр("ru = 'Русский';"
     |en = 'English';"
);

НСтр("ru = 'Русский';
     |en = 'English';"
);

НСтр("ru = 'Русский'
     |en = 'English'"
);

НСтр("ru = 'Русский'; en = 'English';");
НСтр("ru = 'Русский' en = 'English';");
НСтр("ru = 'Русский'" en = 'English';");
НСтр("ru = Русский'" en = 'English';");
НСтр("ru = 'Русский'" en = English';");

НСтр("ru = 'Русский';
     |en = 'English';
     |de = 'Deutsch';
     |fr = 'Français';
     |es = 'Español'"
);

НСтр("ru = 'Все и сразу %1 %% литров ""молока""';
     |en = 'All at once %1 %% liters of ""milk""';
     |de = 'Alles auf einmal %1 %% Liter ""Milch""'");

ТекстЗапроса = "ВЫБРАТЬ
|   Контрагенты.Ссылка КАК Ссылка
|// ПОМЕСТИТЬ Контрагенты
|ИЗ
|   Справочник.Контрагенты КАК Контрагенты";

Если ВыгрузитьВоВременнуюТаблицу Тогда
    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ПОМЕСТИТЬ", "ПОМЕСТИТЬ");
КонецЕсли;

Результат = СтрЗаменить(Результат, "%", "~%");


Выполнить Алгоритм;
Выполнить(Алгоритм);

Х = Неопределено(123);
//  ^ Token.Name.Variable
//    ^ Token.Operator
//      ^^^^^^^^^^^^^^ Token.Generic.Error
//                    ^ Token.Punctuation
Х = Null(123);
//  ^ Token.Name.Variable
//    ^ Token.Operator
//      ^^^^^^^ Token.Generic.Error
//             ^ Token.Punctuation

Рез = (Цена > 0) И (Количество > 0);

Рез = (Цена > 0) И (Количество > 0);

Рез = Не (ЭтоАдмин);

Если Сумма <= 0 Тогда
    ВызватьИсключение "Сумма должна быть больше 0";
    ВызватьИсключение("Сумма должна быть больше 0");
КонецЕсли;

#Если Сервер Или ТолстыйКлиентОбычноеПриложение И НЕ ВнешнееСоединение Тогда
#КонецЕсли

#Если Сервер Тогда
#ИначеЕсли Клиент Тогда
#Иначе
#КонецЕсли

Запрос = Новый Запрос(
    "ВЫБРАТЬ
    |	ТаблицаНомераСчетов.НомерСчета КАК НомерСчета,
    |	ТаблицаНомераСчетов.Владелец КАК Владелец
    |ПОМЕСТИТЬ ТаблицаНомераСчетов
    |ИЗ
    |	&ТаблицаНомераСчетов КАК ТаблицаНомераСчетов
    |ИНДЕКСИРОВАТЬ ПО
    |	Владелец
    |;
    |
    |ВЫБРАТЬ
    |	_ДемоБанковскиеСчета.Ссылка КАК Ссылка
    |ИЗ
    |	Справочник._ДемоБанковскиеСчета КАК _ДемоБанковскиеСчета
    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаНомераСчетов КАК ТаблицаНомераСчетов
    |	ПО _ДемоБанковскиеСчета.НомерСчета = ТаблицаНомераСчетов.НомерСчета
    |	И _ДемоБанковскиеСчета.Владелец = ТаблицаНомераСчетов.Владелец");

Запрос.УстановитьПараметр("ТаблицаНомераСчетов", НомераСчетов);

ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
Если ВыборкаДетальныеЗаписи.Следующий() Тогда
    ПарыЗамен.Вставить(НеобработанныйДубль.ЗаменяемоеЗначение, ВыборкаДетальныеЗаписи.Ссылка);
КонецЕсли;

Если Не ПустаяСтрока(ОбщийТекстЗапроса) Тогда
    ОбщийТекстЗапроса = ОбщийТекстЗапроса + "
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |";
КонецЕсли;

// Параметры:
//  СведенияОбОбновлении - Структура:
//     * КодАдресногоОбъекта - Структура:
//        ** КодРегиона             - Число - код региона (длина - 2).
//        ** КодНаселенногоПункта   - Число - код населенного пункта (длина - 3).
//        ** КодУлицы               - Число - код улицы (длина - 4).
//     * Наименование        - Строка
//     * ОбновлениеДоступно  - Булево

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
// модуль дополнен для использования в качестве фикстуры
///////////////////////////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Получает значение настройки плана обмена по ее имени.
// Для несуществующих настроек возвращается Неопределено.
// 
// Параметры:
//   ИмяПланаОбмена         - Строка - имя плана обмена из метаданных.
//   ИмяПараметра           - Строка - имя параметра плана обмена или список параметров, разделенных запятыми.
//                                     Список допустимых значений см. в функциях НастройкиПланаОбменаПоУмолчанию,
//                                     ОписаниеВариантаНастройкиОбменаПоУмолчанию.
//   ИдентификаторНастройки - Строка - имя предопределенной настройки плана обмена.
//   ВерсияКорреспондента   - Строка - версия конфигурации корреспондента.
// 
// Возвращаемое значение:
//   Произвольный, Структура - тип возвращаемого значения зависит от типа значения получаемой настройки.
//                             Произвольный, если в качестве ИмяПараметра был передан единичный параметр
//                             Структура, если в качестве параметра ИмяПараметра была передан список параметров через запятую.
//
Функция ЗначениеНастройкиПланаОбмена(ИмяПланаОбмена, ИмяПараметра, ИдентификаторНастройки = "", ВерсияКорреспондента = "") Экспорт

    ЗначениеПараметра = Новый Структура;
    НастройкиПланаОбмена = Неопределено;
    ОписаниеВариантаНастройки = Неопределено;
    ИмяПараметра = СтрЗаменить(ИмяПараметра, Символы.ПС, "");



// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЭтоГруппа
	|	ИЛИ ЗначениеРазрешено(Ссылка)";

	Ограничение.ТекстДляВнешнихПользователей =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК _ДемоПартнеры
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеПользователи КАК ВнешниеПользователиПартнеры
	|	ПО ВнешниеПользователиПартнеры.ОбъектАвторизации = _ДемоПартнеры.Ссылка
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник._ДемоКонтактныеЛицаПартнеров КАК _ДемоКонтактныеЛицаПартнеров
	|	ПО _ДемоКонтактныеЛицаПартнеров.Владелец = _ДемоПартнеры.Ссылка
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеПользователи КАК ВнешниеПользователиКонтактныеЛица
	|	ПО ВнешниеПользователиКонтактныеЛица.ОбъектАвторизации = _ДемоКонтактныеЛицаПартнеров.Ссылка
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЭтоГруппа
	|	ИЛИ ЗначениеРазрешено(ВнешниеПользователиПартнеры.Ссылка)
	|	ИЛИ ЗначениеРазрешено(ВнешниеПользователиКонтактныеЛица.Ссылка)";

КонецПроцедуры

// TODO: проверить границы
// {{MRG[ <-> ]
// }}MRG[ <-> ]